//=================//ARRAY//==================//

// let arr = [3, 5, 6, 6.6, 'JavasCript'];
// console.log(arr); // индекс начинается с 0;(5) [3, 5, 6, 6.6, 'JavasCript'] индекс 0: 3,  индекс 1: 5, индекс 2: 6, индекс 3: 6.6, индекс 4: 'JavaScript'
//=========//
// переопределение значения определенного эдемента внутри массива

// let arr = [3, 5, 6, 6.6, 'JavasCript'];
// arr[3] = 'Cool'; // менияем значение индекса 3: 6.6
// console.log(arr); //(5) [3, 5, 6, 'Cool', 'JavasCript']
//=========//
// let arr = [3, 5, 6, 6.6, 'JavasCript'];
// arr[3] = 'Cool';
// console.log(arr[3]); // выводим в консоль конкретный элемент :  Cool

//=========//
// через метод length узнаем длину массива
// let arr = [3, 5, 6, 6.6, 'JavasCript'];
// console.log(arr.length); // 5 // то есть 5 элементов
//=========//
//========================// многомерные массивы // ===========================//
let matrix = [
  [4, 56, 5.5],
  ['JavasCript', 'Pyton', 'Swift'],
  [-100, -55],
];
console.log(matrix);
/* чтобы поменять 'Pyton' на другое значение
обращаемся к переменно matrix [1][1] = 'program' первая цифра 1 индекс массива а второя индекс элемента */
matrix[1][1] = 'program'; // теперь в консоле отображается 'JavasCript', 'program', 'Swift'. Ранее был  'JavasCript', 'Pyton', 'Swift'
