// cycles while и do while(не часто используюся )
// ==========while(condition - тело(условие) ) { stament - тело}  до тех пор пака не выполнится условие не будет==========
// пример 1
// let max = 10;
// let start = 0;
// let current = 0;
// while (current <= max) {
//   // до тех пор пока current меньше или ровно max выведи в консоль 'ок!'
//   console.log('ok!'); //11 ok! (11 потому что началось с 0)
//   current += 1; // при этом current изменяй, каждый раз добавляй на 1
// }
// // пример 2 прохой сценарии
// max = 10;
// start = 0;
// current = 11;
// while (current <= max) {
//   console.log('ok!'); // ничего не выведится в консоль так как current больше max
//   current += 1;
// }

// //============== do{stament - тело } while (condition - тело(условие) )========================================
// do {
//   console.log('ok!'); // ok!
//   current += 1;
// } while (current <= max);
// // ключивое отличие while от do while, при  while сначала проверяется условие потом ужи выполняется действие(если условие не подходят то действия не будет), а в do while ,будет одно действие даже при плохих условиях(так как сначала делется дейтсвие а потом проверятеся условие)

//  ==============for часто используют цикл со счетчиком==========================================
// for (start, condition, step) {
// 	statement
// }
//  for (переменная = его начало; условие; действие) {
//  	statement
// }
//============ Пример 1 ===============
// индекс   0123456789 и так далее
// let text = 'I Love JavaScript';
// console.log(text.length); //17
// // i || о || k старт
// for (let i = 0; i < text.length; i += 2) {
//   // 0  меньше чем 17 тогда выведи на консоль I (начало 0 это I) затем добавляй на 2,  это буква L и так далее
//   console.log(text[i]); //I L v  aa с i t
// }
//============ Пример 2 ===============
//
// ..первый пример
// цикл будет выполнятся 10 раз, начинатся будет с 0 и до тех пор пока она будет меньши или ровно 10, при этом переменная i  будет увеличиватся каждый раз на 1
// for (let i = 0; i <= 10; i++) {
//   console.log(i); // 0 1 2 3 4 5 6 7 8 9 10
// }
//============ Пример 3=============== переменная называется idea
// цикл будет выполнятся до тех пор пока значение будет больше или ровно 5, при этом переменная будет делится каждый раз двое
// for (let idea = 100; idea >= 5; idea /= 2) {
//   console.log(idea); //100 50 25 12.5 6.25
// }
//=========== Пример 4 ==== операторы для циклов ==========
//prikol начинается с 10; если прикол меньше/ровно 20; прикол увеличивай каждый раз на 2
// for (let prikol = 10; prikol <= 20; prikol += 2) {
//   if (prikol > 15)
//     // если (прикол больше 15)
//     break; //..(выйти из условия)
//   console.log(prikol); //  выведи в консоль значение прикол: 16 18 20
// }
//=========== Пример 5 ==== операторы для циклов ==========
// for (let haha = 10; haha <= 20; haha++) {
//   if (haha % 2 === 0) continue; // если при делинии на 2 остаток будет 0,  опертор сontinue позволяет пропустит кукую-ту итерацию, будет выводит не четные цифры
//   console.log(haha); // 11 13 15 17 19
// }
//=========== Пример 5 ==== циклы в массивах ==========
let arr = [5, 7, 8, 9, 87];
for (i = 0; i < arr.length; i++) {
  arr[i] *= 2; //умножаем на 2
  console.log(arr[i]); // 10 14 16 18 174
}
