// // variables====================
// let a = 5;
// let b = 7;
// let c;
// c = a + b; //сначала отработает оператор + потом только значение ставится в переменной c
// console.log(c); // 12

// a = 45; //новое значение переменной a
// b = 56; //новое значение переменной b
// c = a + b; //сначала отработает оператор + потом только значение ставится в переменной c
// console.log(c); // 101
//все это можно переписать через функции===================
// let a = 5;
// let b = 7;
// function sum(a, b) {
//   const c = a + b;
//   console.log(c);
// }
// sum(a, b); //12
// a = 45;
// b = 56;
// sum(a, b); //101
// ==========================================
// function myFn(a, b) {
//   let c;
//   a = a + 1; // 10 + 1 = 11;
//   c = a + b; //11 + 3 = 14
//   return c;
// }
// myFn(10, 3); //14

// =======
function myfn() {}
myfn();
